01Hub/fbedit/STM32F4Discovery/STM32F4_Scope/Scope/main.c
/*******************************************************************************
* File Name          : main.c
* Author             : KetilO
* Version            : V1.0.0
* Date               : 07/06/2012
* Description        : Main program body
********************************************************************************

/* Includes ------------------------------------------------------------------*/
#include "stm32f4_discovery.h"

/* Private define ------------------------------------------------------------*/
#define ADC_CDR_ADDRESS           ((uint32_t)0x40012308)

#define ADC1_DR_Address           ((uint32_t)0x4001244C)
#define PC_IDR_Address            ((uint32_t)0x40011008)
#define STM32_DataSize            ((uint16_t)1024*7)
#define STM32_BlockSize           ((uint8_t)64)
#define STM32_DataSize            ((uint16_t)1024*7)

/* STM32_Command */
#define STM32_CommandWait         ((uint8_t)0)
#define STM32_CommandInit         ((uint8_t)1)
#define STM32_CommandSampleStart  ((uint8_t)2)
#define STM32_CommandDone         ((uint8_t)99)

/* STM32_Modes */
#define STM32_ModeNone            ((uint8_t)0)
#define STM32_ModeScopeCHA        ((uint8_t)1)
#define STM32_ModeScopeCHB        ((uint8_t)2)
#define STM32_ModeScopeCHACHB     ((uint8_t)3)
#define STM32_ModeHSClockCHA      ((uint8_t)4)
#define STM32_ModeHSClockCHB      ((uint8_t)5)
#define STM32_ModeHSClockCHACHB   ((uint8_t)6)
#define STM32_ModeLGA             ((uint8_t)7)
#define STM32_ModeWriteData       ((uint8_t)8)
#define STM32_ModeReadData        ((uint8_t)9)

/* STM32_Triggers */
#define STM32_TriggerManual       ((uint8_t)0)
#define STM32_TriggerRisingCHA    ((uint8_t)1)
#define STM32_TriggerFallingCHA   ((uint8_t)2)
#define STM32_TriggerRisingCHB    ((uint8_t)3)
#define STM32_TriggerFallingCHB   ((uint8_t)4)
#define STM32_TriggerLGA          ((uint8_t)5)

/* Private typedef -----------------------------------------------------------*/
typedef struct
{
  uint8_t   Command;
  uint8_t   Mode;
  uint8_t   ScopeDataBits;
  uint8_t   ScopeSampleClocks;
  uint8_t   ScopeClockDiv;
  uint8_t   ScopeDataBlocks;
  uint8_t   ScopeTriggerMode;
  uint8_t   ScopeTriggerValue;
  uint8_t   ScopeAmplifyCHA;
  uint8_t   ScopeAmplifyCHB;
  uint8_t   ScopeDCNullOutCHA;
  uint8_t   ScopeDCNullOutCHB;
  uint8_t   LGATriggerValue;
  uint8_t   LGATriggerMask;
  uint8_t   LGATriggerEdge;
  uint8_t   TriggerWait;
}CommandStructTypeDef;

typedef struct
{
  uint32_t  Frequency;
  uint32_t  PreviousCount;
  uint16_t  HSCEnable;
  uint16_t  HSCClockDiv;
  uint16_t  HSCCount;
  uint16_t  HSCDuty;
}FRQDataStructTypeDef;

typedef struct
{
  uint32_t  DataSize;
  uint32_t  Adress;
  uint32_t  Data;
}DataStructTypeDef;

typedef struct
{
  FRQDataStructTypeDef FRQDataStructCHA;                // 0x20000000
  FRQDataStructTypeDef FRQDataStructCHB;                // 0x20000010
  CommandStructTypeDef CommandStruct;                   // 0x20000020
  union
  {
    uint8_t STM32_Data[STM32_DataSize];                 // 0x20000030
    DataStructTypeDef DataStruct[100];                  // 0x20000030
  };
}STM32_DataStructTypeDef;

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
__IO STM32_DataStructTypeDef STM32_DataStruct;        // 0x20000014

/* Private function prototypes -----------------------------------------------*/
void Clock_Config(void);
void NVIC_Config(void);
void GPIO_Config(void);
void TIM_Config(void);
void ADC_Config(void);
void DMA_Config(void);

/* Private functions ---------------------------------------------------------*/

/*******************************************************************************
* Function Name  : main
* Description    : Main program
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
int main(void)
{
  u32 i;
  u32 *adr;

  Clock_Config();
  NVIC_Config();
  GPIO_Config();
  TIM_Config();
  ADC_Config();
  while (1)
  {
    if (STM32_DataStruct.CommandStruct.Command == STM32_CommandInit)
    {
      /* Reset STM32_CommandInit */
      STM32_DataStruct.CommandStruct.Command = STM32_CommandWait;
      // /* Turn on LED4 */
      // GPIO_SetBits(GPIOC,GPIO_Pin_8);
      // /* TIM1 disable counter */
      // TIM_Cmd(TIM1, DISABLE);
      // /* TIM1 reset count */
      // TIM1->CNT = (u16)0;
      // /* Set the TIM1 Capture Compare Register values */
      // TIM1->CCR1 = (u16)STM32_DataStruct.STM32_CommandStruct.ADC_TriggerValueCHA;
      // TIM1->CCR2 = (u16)STM32_DataStruct.STM32_CommandStruct.ADC_DCNullOutCHA;
      // TIM1->CCR3 =  (u16)STM32_DataStruct.STM32_CommandStruct.ADC_TriggerValueCHB;
      // TIM1->CCR4 =  (u16)STM32_DataStruct.STM32_CommandStruct.ADC_DCNullOutCHB;
      // /* TIM1 enable counter */
      // TIM_Cmd(TIM1, ENABLE);
      switch (STM32_DataStruct.CommandStruct.Mode)
      {
        case STM32_ModeScopeCHA...STM32_ModeScopeCHACHB:
          /* Set CHA and CHB Amplification levels */
          // GPIOB->ODR = (u16)(GPIOB->ODR & 0x03FF) | ((STM32_DataStruct.STM32_CommandStruct.ADC_AmplifyCHB << 13) | (STM32_DataStruct.STM32_CommandStruct.ADC_AmplifyCHA << 10));
          // /* DMA1 channel1 configuration -----------------------------------------*/
          // DMA_ADC_Configuration();
          // /* ADC1 configuration --------------------------------------------------*/
          // ADC_Configuration();
          break;
        case STM32_ModeHSClockCHA:
          if (STM32_DataStruct.FRQDataStructCHA.HSCEnable)
          {
            /* TIM4 disable counter */
            TIM_Cmd(TIM4, DISABLE);
            /* Reset count */
            TIM4->CNT = 0;
            /* Set the Autoreload value */
            TIM4->ARR = STM32_DataStruct.FRQDataStructCHA.HSCCount;
            /* Set the Prescaler value */
            TIM4->PSC = STM32_DataStruct.FRQDataStructCHA.HSCClockDiv;
            /* Set the Capture Compare Register value */
            TIM4->CCR2 = STM32_DataStruct.FRQDataStructCHA.HSCDuty;
            /* TIM4 enable counter */
            TIM_Cmd(TIM4, ENABLE);
  DMA_Config();
          }
          else
          {
            /* TIM4 disable counter */
            TIM_Cmd(TIM4, DISABLE);
          }
          break;
        case STM32_ModeHSClockCHB:
          if (STM32_DataStruct.FRQDataStructCHB.HSCEnable)
          {
            /* TIM10 disable counter */
            TIM_Cmd(TIM10, DISABLE);
            /* Reset count */
            TIM10->CNT = 0;
            /* Set the Autoreload value */
            TIM10->ARR = STM32_DataStruct.FRQDataStructCHB.HSCCount;
            /* Set the Prescaler value */
            TIM10->PSC = STM32_DataStruct.FRQDataStructCHB.HSCClockDiv;
            /* Set the Capture Compare Register value */
            TIM10->CCR1 = STM32_DataStruct.FRQDataStructCHB.HSCDuty;
            /* TIM10 enable counter */
            TIM_Cmd(TIM10, ENABLE);
          }
          else
          {
            /* TIM10 disable counter */
            TIM_Cmd(TIM10, DISABLE);
          }
          break;
        case STM32_ModeLGA:
          // /* TIM15 configuration ------------------------------------------------*/
          // TIM15_Configuration();
          // /* DMA1 channel5 configuration ----------------------------------------*/
          // DMA_LGA_Configuration();
          break;
        case STM32_ModeWriteData:
          // adr = (u32 *)STM32_DataStruct.STM32_CommandStruct.Address;
          // *adr = STM32_DataStruct.STM32_CommandStruct.dByte;
          break;
        case STM32_ModeReadData:
          // adr = (u32 *)STM32_DataStruct.STM32_CommandStruct.Address;
          // STM32_DataStruct.STM32_CommandStruct.dByte = *adr;
          break;
      }
    }
    else if (STM32_DataStruct.CommandStruct.Command == STM32_CommandSampleStart)
    {
      // /* Turn off LED4 */
      // GPIO_ResetBits(GPIOC,GPIO_Pin_8);
      // /* Turn on LED3 */
      // GPIO_SetBits(GPIOC,GPIO_Pin_9);
      // switch (STM32_DataStruct.STM32_CommandStruct.STM32_Mode)
      // {
        // case STM32_ModeScopeCHA:
          // /* ADC1 regular channel 8 configuration */ 
          // /* Set sample time for channel 8 */
          // ADC1->SMPR2 = ((u32)STM32_DataStruct.STM32_CommandStruct.STM32_SampleRateL << 24);
          // /* Set rank 1 for channel 8 */
          // /* |00|Rank6|Rank5|Rank4|Rank3|Rank2|Rank1| */
          // /* |00|00000|00000|00000|00000|00000|01000| */
          // ADC1->SQR3 = (u32)0x00000008;
          // /* Enable ADC1 DMA */
          // ADC1->CR2 |=(u32)0x00000100;
          // /* Enable ADC1 */
          // ADC1->CR2 |= (u32)0x00000001;
          // WaitForTrigger();
          // /* Enable DMA1 channel1 */
          // DMA1_Channel1->CCR |= (u32)0x00000001;
          // /* Wait until DMA transfer complete */
          // while ((DMA1->ISR && DMA1_FLAG_TC1) == 0)
          // {
          // }
          // /* Disable DMA */
          // DMA_Cmd(DMA1_Channel1, DISABLE);
          // /* Disable ADC1 */
          // ADC_SoftwareStartConvCmd(ADC1, DISABLE);
          // break;
        // case STM32_ModeScopeCHB:
          // /* ADC1 regular channel 9 configuration */ 
          // /* Set sample time for channel 9 */
          // ADC1->SMPR2 = ((u32)STM32_DataStruct.STM32_CommandStruct.STM32_SampleRateL << 27);
          // /* Set rank 1 for channel 9 */
          // /* |00|Rank6|Rank5|Rank4|Rank3|Rank2|Rank1| */
          // /* |00|00000|00000|00000|00000|00000|01001| */
          // ADC1->SQR3 = (u32)0x00000009;
          // /* Enable ADC1 DMA */
          // ADC1->CR2 |=(u32)0x00000100;
          // /* Enable ADC1 */
          // ADC1->CR2 |= (u32)0x00000001;
          // WaitForTrigger();
          // /* Enable DMA1 channel1 */
          // DMA1_Channel1->CCR |= (u32)0x00000001;
          // /* Wait until DMA transfer complete */
          // while ((DMA1->ISR && DMA1_FLAG_TC1) == 0)
          // {
          // }
          // /* Disable DMA */
          // DMA_Cmd(DMA1_Channel1, DISABLE);
          // /* Disable ADC1 */
          // ADC_SoftwareStartConvCmd(ADC1, DISABLE);
          // break;
        // case STM32_ModeScopeCHACHB:
          // WaitForTrigger();
          // /* ADC1 regular channel 8 and channel 9 configuration */ 
          // /* Set sample time for channel 8 and channel 9 */
          // ADC1->SMPR2 = (((u32)STM32_DataStruct.STM32_CommandStruct.STM32_SampleRateL << 24) | ((u32)STM32_DataStruct.STM32_CommandStruct.STM32_SampleRateL << 27));
          // /* Set rank 2 for channel 8 and rank 1 for channel 9 */
          // /* |00|Rank6|Rank5|Rank4|Rank3|Rank2|Rank1| */
          // /* |00|00000|00000|00000|00000|01000|01001| */
          // ADC1->SQR3 = (u32)0x00000109;
          // /* Enable DMA1 channel1 */
          // DMA1_Channel1->CCR |= (u32)0x00000001;
          // /* Enable ADC1 DMA */
          // ADC1->CR2 |=(u32)0x00000100;
          // /* Enable ADC1 */
          // ADC1->CR2 |= (u32)0x00000001;
          /* Wait until DMA transfer complete */
          // while ((DMA1->ISR && DMA1_FLAG_TC1) == 0)
          // {
          // }
          // /* Disable DMA */
          // DMA_Cmd(DMA1_Channel1, DISABLE);
          // /* Disable ADC1 */
          // ADC_SoftwareStartConvCmd(ADC1, DISABLE);
          // break;
        // case STM32_ModeWaveCHA:
          // break;
        // case STM32_ModeWaveCHB:
          // break;
        // case STM32_ModeWaveCHACHB:
          // break;
        // case STM32_ModeLGA:
          // if ((STM32_DataStruct.STM32_CommandStruct.STM32_SampleRateH << 8) + STM32_DataStruct.STM32_CommandStruct.STM32_SampleRateL == 0)
          // {
            // /* Wait for trigger */
            // WaitForTrigger();
            // FAST_LGA_Read();
          // }
          // else
          // {
            // /* Enable DMA1 channel5 */
            // DMA1_Channel5->CCR |= (u32)0x00000001;
            // /* Set TIM15 Counter */
            // TIM_SetCounter(TIM15,(u16)(STM32_DataStruct.STM32_CommandStruct.STM32_SampleRateH << 8) + STM32_DataStruct.STM32_CommandStruct.STM32_SampleRateL);
            // /* Wait for trigger */
            // WaitForTrigger();
            // /* Enable TIM15 */
            // TIM15->CR1 = (u16)0x0001;
            // /* Wait until DMA transfer complete */
            // while ((DMA1->ISR && DMA1_FLAG_TC5) == 0)
            // {
            // }
            // /* Disable DMA */
            // DMA_Cmd(DMA1_Channel5, DISABLE);
            // /* Disable TIM15 */
            // TIM_Cmd(TIM15, DISABLE);
          // }
          // break;
      // }
      // ADC_DVMConfiguration();
      /* Set sample ready to be read flag */
      STM32_DataStruct.CommandStruct.Command = STM32_CommandDone;
    }
    i=0;
    while (i < 1000000)
    {
      i++;
    }
    ADC_SoftwareStartInjectedConv(ADC3);
  }
}

