01Hub/fbedit/STM32F4Discovery/STM32F4_Scope/Scope/main.c
/*******************************************************************************
* Function Name  : NVIC_Configuration
* Description    : Configures Vector Table base location.
*                  Configures interrupts.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
// void NVIC_Configuration(void)
// {
  // NVIC_InitTypeDef NVIC_InitStructure;

  // /* Set the Vector Table base location at 0x08000000 */ 
  // NVIC_SetVectorTable(NVIC_VectTab_FLASH, 0x0);   
  // /* Enable the TIM2 global Interrupt */
  // NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQChannel;
  // NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  // NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
  // NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  // NVIC_Init(&NVIC_InitStructure);
  // /* Enable the TIM3 global Interrupt */
  // NVIC_InitStructure.NVIC_IRQChannel = TIM3_IRQChannel;
  // NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  // NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;
  // NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  // NVIC_Init(&NVIC_InitStructure);
  // /* Enable the TIM4 global Interrupt */
  // NVIC_InitStructure.NVIC_IRQChannel = TIM4_IRQChannel;
  // NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  // NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
  // NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  // NVIC_Init(&NVIC_InitStructure);
// }

/*******************************************************************************
* Function Name  : TIM1_Configuration
* Description    : Configures TIM1 to generate PWM output.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
// void TIM1_Configuration(void)
// {
  /* -----------------------------------------------------------------------
    TIM1 Configuration: generate 4 PWM signals with 4 different duty cycles:
    TIM1CLK = 28 MHz, Prescaler = 0x0, TIM1 counter clock = 28 MHz
    TIM1 ARR Register = 255 => TIM1 Frequency = TIM1 counter clock/(ARR + 1)
    TIM1 Frequency = 109.375 KHz.
    TIM1 Channel1 duty cycle = (TIM1_CCR1 / TIM1_ARR)* 100
    TIM1 Channel2 duty cycle = (TIM1_CCR2 / TIM1_ARR)* 100
    TIM1 Channel3 duty cycle = (TIM1_CCR3 / TIM1_ARR)* 100
    TIM1 Channel4 duty cycle = (TIM1_CCR4 / TIM1_ARR)* 100
  ----------------------------------------------------------------------- */

  // TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
  // TIM_OCInitTypeDef  TIM_OCInitStructure;
  // /* Time base configuration */
  // TIM_TimeBaseStructure.TIM_Period = 255;
  // TIM_TimeBaseStructure.TIM_Prescaler = 0;
  // TIM_TimeBaseStructure.TIM_ClockDivision = 0;
  // TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  // TIM_TimeBaseInit(TIM1, &TIM_TimeBaseStructure);

  // TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
  // TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
  // TIM_OCInitStructure.TIM_OutputNState = TIM_OutputState_Disable;
  // TIM_OCInitStructure.TIM_Pulse = (u16)0x7F;
  // TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
  // TIM_OCInitStructure.TIM_OCNPolarity = TIM_OCPolarity_Low;
  // TIM_OCInitStructure.TIM_OCIdleState = TIM_OCIdleState_Reset;
  // TIM_OCInitStructure.TIM_OCNIdleState = TIM_OCIdleState_Reset;
  // /* PWM1 Mode configuration: Channel1 */
  // TIM_OC1Init(TIM1, &TIM_OCInitStructure);
  // TIM_OC1PreloadConfig(TIM1, TIM_OCPreload_Enable);
  // /* PWM1 Mode configuration: Channel2 */
  // TIM_OC2Init(TIM1, &TIM_OCInitStructure);
  // TIM_OC2PreloadConfig(TIM1, TIM_OCPreload_Enable);
  // /* PWM1 Mode configuration: Channel3 */
  // TIM_OC3Init(TIM1, &TIM_OCInitStructure);
  // TIM_OC3PreloadConfig(TIM1, TIM_OCPreload_Enable);
  // /* PWM1 Mode configuration: Channel4 */
  // TIM_OC4Init(TIM1, &TIM_OCInitStructure);
  // TIM_OC4PreloadConfig(TIM1, TIM_OCPreload_Enable);
  // /* TIM1 enable counter */
  // TIM_Cmd(TIM1, ENABLE);
  // /* TIM1 Main Output Enable */
  // TIM_CtrlPWMOutputs(TIM1, ENABLE);
// }

/*******************************************************************************
* Function Name  : TIM2_Configuration
* Description    : Configures TIM2 to count up on rising edges on CH2 PA.01
*                  An interrupt is generated on each rollover.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
// void TIM2_Configuration(void)
// {
  // TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
  // /* Time base configuration */
  // TIM_TimeBaseStructure.TIM_Period = 0xffff;
  // TIM_TimeBaseStructure.TIM_Prescaler = 0;
  // TIM_TimeBaseStructure.TIM_ClockDivision = 0;
  // TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  // TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);
  // TIM2->CCMR1 = 0x0100;     //CC2S=01
  // TIM2->SMCR = 0x0067;      //TS=110, SMS=111
// }

/*******************************************************************************
* Function Name  : TIM3_Configuration
* Description    : Configures TIM3 to count up and generate interrupt every 1000ms.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
// void TIM3_Configuration(void)
// {
  // TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
  // /* Time base configuration */
  // TIM_TimeBaseStructure.TIM_Period = 9999;
// #ifdef STM32Clock24MHz
  // TIM_TimeBaseStructure.TIM_Prescaler = 2399;
// #endif
// #ifdef STM32Clock28MHz
  // TIM_TimeBaseStructure.TIM_Prescaler = 2799;
// #endif
// #ifdef STM32Clock32MHz
  // TIM_TimeBaseStructure.TIM_Prescaler = 3199;
// #endif
// #ifdef STM32Clock40MHz
  // TIM_TimeBaseStructure.TIM_Prescaler = 3999;
// #endif
// #ifdef STM32Clock48MHz
  // TIM_TimeBaseStructure.TIM_Prescaler = 4799;
// #endif
// #ifdef STM32Clock56MHz
  // TIM_TimeBaseStructure.TIM_Prescaler = 5599;
// #endif
  // TIM_TimeBaseStructure.TIM_ClockDivision = 0;
  // TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  // TIM_TimeBaseInit(TIM3, &TIM_TimeBaseStructure);
  // TIM_InternalClockConfig(TIM3);
// }

