01Hub/fbedit/STM32F4Discovery/STM32F4_Scope/Scope/main.c
/*******************************************************************************
* Function Name  : TIM4_Configuration
* Description    : Configures TIM4 to count up on rising edges on CH2 PB.07
*                  An interrupt is generated on each rollover.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
// void TIM4_Configuration(void)
// {
  // TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
  // /* Time base configuration */
  // TIM_TimeBaseStructure.TIM_Period = 0xffff;
  // TIM_TimeBaseStructure.TIM_Prescaler = 0;
  // TIM_TimeBaseStructure.TIM_ClockDivision = 0;
  // TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  // TIM_TimeBaseInit(TIM4, &TIM_TimeBaseStructure);
  // TIM4->CCMR1 = 0x0001;     //CC2S=01
  // TIM4->SMCR = 0x0067;      //TS=110, SMS=111
// }

/*******************************************************************************
* Function Name  : TIM6_Configuration
* Description    : Configures TIM6 to count up.
*                  A TRG0 signal is generated on each rollover.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
// void TIM6_Configuration(void)
// {
  // /* TIM6 TRGO selection */
  // TIM_SelectOutputTrigger(TIM6, TIM_TRGOSource_Update);
  // /* TIM6 enable counter */
  // TIM_Cmd(TIM6, ENABLE);
// }

/*******************************************************************************
* Function Name  : TIM7_Configuration
* Description    : Configures TIM7 to count up.
*                  A TRG0 signal is generated on each rollover.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
// void TIM7_Configuration(void)
// {
  // /* TIM6 TRGO selection */
  // TIM_SelectOutputTrigger(TIM7, TIM_TRGOSource_Update);
  // /* TIM7 enable counter */
  // TIM_Cmd(TIM7, ENABLE);
// }

/*******************************************************************************
* Function Name  : TIM15_Configuration
* Description    : Configures TIM115 to count up.
*                  A DMA request is generated on each rollover.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
// void TIM15_Configuration()
// {
  // TIM_DeInit(TIM15);
  // TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
  // /* Time base configuration */
  // TIM_TimeBaseStructure.TIM_Period = (STM32_DataStruct.STM32_CommandStruct.STM32_SampleRateH << 8) + STM32_DataStruct.STM32_CommandStruct.STM32_SampleRateL;
  // TIM_TimeBaseStructure.TIM_Prescaler = 0;
  // TIM_TimeBaseStructure.TIM_ClockDivision = 0;
  // TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  // TIM_TimeBaseInit(TIM15, &TIM_TimeBaseStructure);
  // TIM_DMACmd(TIM15,TIM_DMA_Update,ENABLE);
// }

/*******************************************************************************
* Function Name  : TIM16_Configuration
* Description    : Configures TIM16 to generate PWM output.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
// void TIM16_Configuration(void)
// {
  // TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
  // TIM_OCInitTypeDef  TIM_OCInitStructure;
  // /* Time base configuration */
  // TIM_TimeBaseStructure.TIM_Period = 255;
  // TIM_TimeBaseStructure.TIM_Prescaler = 0;
  // TIM_TimeBaseStructure.TIM_ClockDivision = 0;
  // TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  // TIM_TimeBaseInit(TIM16, &TIM_TimeBaseStructure);
  // /* PWM1 Mode configuration: Channel1 */
  // TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
  // TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
  // TIM_OCInitStructure.TIM_Pulse = (u16)0x0000;
  // TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
  // TIM_OC1Init(TIM16, &TIM_OCInitStructure);
  // TIM_OC1PreloadConfig(TIM16, TIM_OCPreload_Enable);
  // TIM16->CCR1 = (u16)0x7F;
  // /* TIM16 Main Output Enable */
  // TIM_CtrlPWMOutputs(TIM16, ENABLE);
// }

/*******************************************************************************
* Function Name  : TIM17_Configuration
* Description    : Configures TIM17 to generate PWM output.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
// void TIM17_Configuration(void)
// {
  // TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
  // TIM_OCInitTypeDef  TIM_OCInitStructure;
  // /* Time base configuration */
  // TIM_TimeBaseStructure.TIM_Period = 255;
  // TIM_TimeBaseStructure.TIM_Prescaler = 0;
  // TIM_TimeBaseStructure.TIM_ClockDivision = 0;
  // TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  // TIM_TimeBaseInit(TIM17, &TIM_TimeBaseStructure);
  // /* PWM1 Mode configuration: Channel1 */
  // TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
  // TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
  // TIM_OCInitStructure.TIM_Pulse = (u16)0x0000;
  // TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
  // TIM_OC1Init(TIM17, &TIM_OCInitStructure);
  // TIM_OC1PreloadConfig(TIM17, TIM_OCPreload_Enable);
  // TIM17->CCR1 = (u16)0x7F;
  // /* TIM17 Main Output Enable */
  // TIM_CtrlPWMOutputs(TIM17, ENABLE);
// }

void Clock_Config(void)
{
  /* Enable DMA2, GPIOA, GPIOB, GPIOC and GPIOE clocks ****************************************/
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2 | RCC_AHB1Periph_GPIOA | RCC_AHB1Periph_GPIOB | RCC_AHB1Periph_GPIOC | RCC_AHB1Periph_GPIOE, ENABLE);
  /* Enable TIM2, TIM3, TIM4 and TIM5 clocks ****************************************/
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2 | RCC_APB1Periph_TIM3 | RCC_APB1Periph_TIM4 | RCC_APB1Periph_TIM5, ENABLE);
  /* Enable TIM10 clocks ****************************************/
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM10 | RCC_APB2Periph_ADC1 | RCC_APB2Periph_ADC2 | RCC_APB2Periph_ADC3, ENABLE);
}

void NVIC_Config(void)
{
  NVIC_InitTypeDef NVIC_InitStructure;

